export function getMonth(n) {
    if (isNaN(n) || !Number.isInteger(n)) {
        return "Номер месяца должен быть целым числом";
    } else if (n < 1 || n > 12) {
        return "Номер месяца должен быть в диапазоне от 1 до 12";
    } else {
        const monthsNames = {
            "1": "январь",
            "2": "февраль",
            "3": "март",
            "4": "апрель",
            "5": "май",
            "6": "июнь",
            "7": "июль",
            "8": "август",
            "9": "сентябрь",
            "10": "октябрь",
            "11": "ноябрь",
            "12": "декабрь"
        }
        return monthsNames[n.toString()]
    }    
}